KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьПропускНаВъездВыезд/КАНАТ_ПечатьПропускНаВъездВыезд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ПечатьПропускНаВъездВыезд</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РаспоряжениеНаОтгрузку/КАНАТ_РаспоряжениеНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РаспоряжениеНаОтгрузку</name>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСопроводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтомобильМарка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ВодительСсылка</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_ПропускНаВыезд/КАНАТ_ПропускНаВыезд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_ПропускНаВыезд</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСопроводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТМЦ</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДолжность</name>
    <type>
      <types>EnumRef.КАНАТ_РолиПодписантов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9eab2298-ca44-4cc2-a529-95431e0e3800">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="861dd4a6-11fe-4e8a-94aa-230cc1037aa1">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5ebb45d-36cc-4d4e-aaae-5effa624ce42">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd65fde8-b84e-417c-a0f6-6d991416b565">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a96d4ac2-d10a-4fee-87a1-589480786aff">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8a622e4b-561c-49a4-97dd-da5615b0c95f">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="50371f97-7440-48ec-8481-2c7e9c812287">
    <name>ПлатежноРасчетныеДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="043d3fd2-2de7-4440-9727-ac6351b61a5e">
      <name>НомерПлатежноРасчетногоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7b0e9642-7b63-4ca0-b12e-34bdd79511b9">
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_НТДНоменклатуры</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="0e7e0970-627b-458f-8d96-ef13c523d2b8">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КАНАТКач_ВидДляКонтроляКачества</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1b521724-19bd-43e6-b544-b67dc4ba22b9">
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТекстДублиАртикулов</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_НеГенерироватьАртикул</name>
    <comment>#000000054, ЧТЗ_3_8 Артикул=код</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="97ef8ff9-68db-45ee-91be-54bfb600b3a1">
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ОБъектБылИзменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_ПоказателиНТД</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Размерность</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьПропускНаВъездВыезд/ManagerModule.bsl
//++ Гурьев 25.09.23 ЧТЗ_2.10
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Для Каждого Документ Из МассивОбъектов Цикл
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПропускНаВъезд") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПропускНаВъезд",
				"Пропуск на въезд",
				СформироватьПропускНаВъезд(Документ));
		КонецЕсли;
			
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПропускНаВыезд") Тогда
			СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ПропускНаВыезд",
				"Пропуск на выезд",
				СформироватьПропускНаВыезд(Документ));
		КонецЕсли;
	КонецЦикла;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры
//-- Гурьев 25.09.23

//++ Гурьев 25.09.23 ЧТЗ_2.10
Функция СформироватьПропускНаВъезд(Документ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьПропускНаВъездВыезд.ПФ_MXL_ПечатьПропускНаВъезд");
	
	///Шапка
	ДанныеШапки = ПолучитьДанныеШапкиПропускНаВъезд(Документ);
	Если ДанныеШапки = Неопределено Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	ОбластьШапка.Параметры.Дата = Формат(ДанныеШапки.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДанныеШапки.Номер);
	
	Если ДанныеШапки.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента
		ИЛИ ДанныеШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		ОбластьШапка.Параметры.Водитель = ДанныеШапки.КАНАТ_ВодительСсылка;
		
	КонецЕсли;
	
		
	Если ДанныеШапки.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
		
		ОбластьШапка.Параметры.СпособДоставки = СтрШаблон("%1, %2, %3",
														  ДанныеШапки.СпособДоставки,
														  ДанныеШапки.Перевозчик,
														  ДанныеШапки.АдресПеревозчика);
		
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(ДанныеШапки.Грузополучатель) Тогда
	//	ОбластьШапка.Параметры.Грузополучатель = ДанныеШапки.Контрагент;
	//КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Таблица
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаШапка);
	
	ТаблицаИтого = Новый ТабличныйДокумент;
	
	ДанныеТаблицыВыборкаЕдИзм = ПолучитьДанныеТаблицыПропускНаВъезд(Документ);
	
	Сумма = 0;
	СуммаСНДС = 0;
	СуммаСоСкидкой = 0;
	
	Пока ДанныеТаблицыВыборкаЕдИзм.Следующий() Цикл
		
		ОбластьТаблицаИтогоСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаИтогоСтрока");
		ОбластьТаблицаИтогоСтрока.Параметры.Заполнить(ДанныеТаблицыВыборкаЕдИзм);
		ТаблицаИтого.Вывести(ОбластьТаблицаИтогоСтрока);
		
		ВыборкаДетальныеЗаписи = ДанныеТаблицыВыборкаЕдИзм.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
			ОбластьТаблицаСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			
			ТабличныйДокумент.Вывести(ОбластьТаблицаСтрока);
			
			Сумма =     Сумма + ВыборкаДетальныеЗаписи.Количество * ВыборкаДетальныеЗаписи.Цена;
			СуммаСНДС = СуммаСНДС + ВыборкаДетальныеЗаписи.Количество * ВыборкаДетальныеЗаписи.ЦенаСНДС;
			СуммаСоСкидкой = СуммаСоСкидкой + ВыборкаДетальныеЗаписи.СуммаСоСкидкой;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьТаблицаИтогоШапка = Макет.ПолучитьОбласть("ОбластьТаблицаИтогоШапка");
	ТабличныйДокумент.Вывести(ОбластьТаблицаИтогоШапка);
	
	ТабличныйДокумент.Вывести(ТаблицаИтого);
	
	//Подвал
	ОбластьТаблицаПодвал = Макет.ПолучитьОбласть("ОбластьТаблицаПодвал");
	ОбластьТаблицаПодвал.Параметры.Сумма = Формат(Сумма, "ЧДЦ=2");
	ОбластьТаблицаПодвал.Параметры.СуммаНДС = Формат(СуммаСНДС - Сумма, "ЧДЦ=2");
	ОбластьТаблицаПодвал.Параметры.СуммаСНДС = Формат(СуммаСНДС, "ЧДЦ=2");
	ОбластьТаблицаПодвал.Параметры.СуммаСоСкидкой = Формат(СуммаСоСкидкой, "ЧДЦ=2");
	ТабличныйДокумент.Вывести(ОбластьТаблицаПодвал);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 25.09.23

//++ Гурьев 25.09.23 ЧТЗ_2.10
Функция ПолучитьДанныеШапкиПропускНаВъезд_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Контрагент КАК Контрагент,
		|	ЗаказКлиента.Склад КАК Склад,
		|	ЗаказКлиента.Грузополучатель КАК Грузополучатель,
		|	ЗаказКлиента.СпособДоставки КАК СпособДоставки,
		|	ЗаказКлиента.КАНАТ_НомерИДатаДоверенности КАК НомерДоверенности,
		|	ЗаказКлиента.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
		|	ЗаказКлиента.КАНАТ_Водитель КАК Водитель,
		|	ЗаказКлиента.КАНАТ_ГосНомер КАК ГосНомер,
		|	ЗаказКлиента.КАНАТ_АвтомобильМарка КАК АвтомобильМарка,
		|	ЗаказКлиента.АдресДоставки КАК АдресДоставки
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить()[0];
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
//-- Гурьев 25.09.23

//++ Гурьев 25.09.23 ЧТЗ_2.10
Функция ПолучитьДанныеТаблицыПропускНаВъезд_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	ЗаказКлиентаТовары.Номенклатура КАК Наименование,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК НДС,
	|	ЗаказКлиентаТовары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
	|	ЗаказКлиентаТовары.Цена * (1 + ЗаказКлиентаТовары.СтавкаНДС.Ставка / 100) КАК ЦенаСНДС
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ЗаказКлиентаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Документ
	|ИТОГИ
	|	Сумма(Количество)
	|ПО
	|	ЕдИзм";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции
//-- Гурьев 25.09.23

//++ Гурьев 26.09.23 ЧТЗ_2.10
Функция СформироватьПропускНаВыезд(Документ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Ложь;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьПропускНаВъездВыезд.ПФ_MXL_ПечатьПропускНаВыезд");
	ДанныеПФ = ПолучитьДанныеПФПропускНаВыезд(Документ);
	Если ДанныеПФ.Количество() = 0 Тогда
		
		Сообщить("Не найдены документы ""Реализация товаров и услуг"" с заполненными документами ""Заказ клиента"", у которых есть товары.");
		Возврат ТабличныйДокумент;
		
	КонецЕсли;
	
	//Шапка
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.Заполнить(ДанныеПФ[0]);
	ОбластьШапка.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДанныеПФ[0].Номер);
	ОбластьШапка.Параметры.Дата = Формат(ДанныеПФ[0].Дата, "ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//ТМЦ
	Для Каждого Строка Из ДанныеПФ Цикл
		
		ОбластьТМЦ = Макет.ПолучитьОбласть("ОбластьТМЦ");
		ОбластьТМЦ.Параметры.ТМЦ            = Строка.ТМЦ;
		ОбластьТМЦ.Параметры.НомерНакладной = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Строка.НомерНакладной);
		ОбластьТМЦ.Параметры.ДатаНакладной  = Формат(Строка.ДатаНакладной, "ДФ=dd.MM.yyyy");
		ОбластьТМЦ.Параметры.КоличествоМест = СтрШаблон("%1 (%2)", Строка.КоличествоМест,
																   ЧислоПрописью(Строка.КоличествоМест,, ",,,,,,,,0"));
		ТабличныйДокумент.Вывести(ОбластьТМЦ);
		
	КонецЦикла;
	
	//Подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.Заполнить(ДанныеПФ[0]);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//-- Гурьев 26.09.23 

//++ Гурьев 26.09.23 ЧТЗ_2.10
Функция ПолучитьДанныеПФПропускНаВыезд_устар(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|	ВЫБРАТЬ
	|	ТранспортнаяНакладная.Номер КАК Номер,
	|	ТранспортнаяНакладная.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Склад КАК НаименованиеПодразделения,
	|	ТранспортнаяНакладная.Грузополучатель КАК НаименованиеОрганизацииГрузополучателя,
	|	ТранспортнаяНакладная.Водитель КАК Водитель,
	|	ТранспортнаяНакладная.КАНАТ_ФИОСопроводителя КАК ФИОСопроводителя,
	|	ТранспортнаяНакладная.АвтомобильГосударственныйНомер КАК Автотранспорт,
	|	СправочникНоменклатура.ГруппаФинансовогоУчета КАК ТМЦ,
	|	РеализацияТоваровУслуг.Номер КАК НомерНакладной,
	|	РеализацияТоваровУслуг.Дата КАК ДатаНакладной,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.НомерСтроки) КАК КоличествоМест
	|ИЗ
	|	Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|			ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ПОЛНОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|						ПО ЗаказКлиентаТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|					ПО ДокументЗаказКлиента.Ссылка = ЗаказКлиентаТовары.Ссылка
	|				ПО РеализацияТоваровУслуг.ЗаказКлиента = ДокументЗаказКлиента.Ссылка
	|				ПРАВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|				ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
	|			ПО ТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ПО ТранспортнаяНакладная.Ссылка = ТранспортнаяНакладнаяДокументыОснования.Ссылка
	|ГДЕ
	|	ТранспортнаяНакладная.Ссылка = &Документ
	|	И ЗаказКлиентаТовары.НомерСтроки = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ТранспортнаяНакладная.Номер,
	|	ТранспортнаяНакладная.Дата,
	|	РеализацияТоваровУслуг.Склад,
	|	ТранспортнаяНакладная.Грузополучатель,
	|	ТранспортнаяНакладная.Водитель,
	|	ТранспортнаяНакладная.КАНАТ_ФИОСопроводителя,
	|	ТранспортнаяНакладная.АвтомобильГосударственныйНомер,
	|	СправочникНоменклатура.ГруппаФинансовогоУчета,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//-- Гурьев 26.09.23

//++ Гурьев 15.11.23 ЧТЗ_2.10
Функция ПолучитьДанныеШапкиПропускНаВъезд(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Контрагент КАК Контрагент,
		|	ЗаказКлиента.Склад КАК Склад,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Номер КАК Номер,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Дата КАК Дата,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Грузополучатель.НаименованиеПолное КАК Грузополучатель,
		|	КАНАТ_РаспоряжениеНаОтгрузку.СпособДоставки КАК СпособДоставки,
		|	КАНАТ_РаспоряжениеНаОтгрузку.НомерИДатаДоверенности КАК НомерДоверенности,
		|	КАНАТ_РаспоряжениеНаОтгрузку.ФИОСопроводителя КАК ФИОСопроводителя,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Водитель КАК Водитель,
		|	КАНАТ_РаспоряжениеНаОтгрузку.КАНАТ_ВодительСсылка КАК КАНАТ_ВодительСсылка,
		|	КАНАТ_РаспоряжениеНаОтгрузку.ГосНомер КАК ГосНомер,
		|	КАНАТ_РаспоряжениеНаОтгрузку.АвтомобильМарка КАК АвтомобильМарка,
		|	КАНАТ_РаспоряжениеНаОтгрузку.Адрес КАК АдресДоставки,
		|	ЗаказКлиента.ПеревозчикПартнер КАК Перевозчик,
		|	ЗаказКлиента.АдресДоставкиПеревозчика КАК АдресПеревозчика
		|ИЗ
		|	Документ.КАНАТ_РаспоряжениеНаОтгрузку КАК КАНАТ_РаспоряжениеНаОтгрузку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО КАНАТ_РаспоряжениеНаОтгрузку.ДокументОснование = ЗаказКлиента.Ссылка
		|ГДЕ
		|	КАНАТ_РаспоряжениеНаОтгрузку.Ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить()[0];
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
//-- Гурьев 15.11.23

//++ Гурьев 15.11.23 ЧТЗ_2.10
Функция ПолучитьДанныеТаблицыПропускНаВъезд(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СправочникНоменклатура.Артикул КАК Артикул,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена * (1 + КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка / 100) КАК ЦенаСНДС,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Номенклатура КАК Наименование,
				   //БИТ_Гурьев_мелкие замечания_22.05.24++
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Характеристика КАК Характеристика,
				   //БИТ_Гурьев_мелкие замечания_22.05.24--
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Упаковка КАК ЕдИзм,
	               |	СУММА(КАНАТ_РаспоряжениеНаОтгрузкуТовары.Количество) КАК Количество,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена КАК Цена,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС КАК НДС,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_Сертификат КАК Сертификат,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_КомментарийКЗаказу КАК Комментарий,
	               |	СУММА(КАНАТ_РаспоряжениеНаОтгрузкуТовары.СуммаСНДС) КАК СуммаСоСкидкой
	               |ИЗ
	               |	Документ.КАНАТ_РаспоряжениеНаОтгрузку.Товары КАК КАНАТ_РаспоряжениеНаОтгрузкуТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ПО КАНАТ_РаспоряжениеНаОтгрузкуТовары.Номенклатура = СправочникНоменклатура.Ссылка
	               |ГДЕ
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Ссылка = &Документ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СправочникНоменклатура.Артикул,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Номенклатура,
				   //БИТ_Гурьев_мелкие замечания_22.05.24++
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Характеристика,
				   //БИТ_Гурьев_мелкие замечания_22.05.24--
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Упаковка,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_Сертификат,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.КАНАТ_КомментарийКЗаказу,
	               |	КАНАТ_РаспоряжениеНаОтгрузкуТовары.Цена * (1 + КАНАТ_РаспоряжениеНаОтгрузкуТовары.СтавкаНДС.Ставка / 100)
	               |ИТОГИ
	               |	СУММА(Количество)
	               |ПО
	               |	ЕдИзм";
					
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции
//-- Гурьев 15.11.23  

//++ Гурьев 17.11.23 ЧТЗ_2.10
Функция ПолучитьДанныеПФПропускНаВыезд(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КАНАТ_ПропускНаВыезд.Номер КАК Номер,
	               |	КАНАТ_ПропускНаВыезд.Дата КАК Дата,
	               |	КАНАТ_ПропускНаВыезд.Организация КАК Организация,
	               |	КАНАТ_ПропускНаВыезд.Подразделение КАК НаименованиеПодразделения,
	               |	КАНАТ_ПропускНаВыезд.ФИОСопроводителя КАК ФИОСопроводителя,
	               |	КАНАТ_ПропускНаВыезд.Водитель КАК Водитель,
	               |	КАНАТ_ПропускНаВыезд.Марка + "" "" + КАНАТ_ПропускНаВыезд.ГосНомер КАК Автотранспорт,
	               |	КАНАТ_ПропускНаВыезд.ТМЦ КАК ТМЦ,
	               |	СчетФактураВыданный.Номер КАК НомерНакладной,
	               |	СчетФактураВыданный.Дата КАК ДатаНакладной,
	               |	КАНАТ_ПропускНаВыезд.КоличествоМест КАК КоличествоМест,
	               |	КАНАТ_ПропускНаВыезд.ПодписантДолжность КАК ДолжностьПодпись,
	               |	КАНАТ_ПропускНаВыезд.ПодписантСотрудник КАК ИмяПодпись,
	               |	КАНАТ_ПропускНаВыезд.Грузополучатель КАК НаименованиеОрганизацииГрузополучателя,
	               |	КАНАТ_ПропускНаВыезд.Грузополучатель.НаименованиеПолное КАК СокрГрузополучатель
	               |ИЗ
	               |	Документ.КАНАТ_ПропускНаВыезд КАК КАНАТ_ПропускНаВыезд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |			ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
	               |		ПО КАНАТ_ПропускНаВыезд.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	               |ГДЕ
	               |	КАНАТ_ПропускНаВыезд.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//-- Гурьев 17.11.23
